src/toir_cf/src/InformationRegisters/торо_ПорядокОРПоИерархии/торо_ПорядокОРПоИерархии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ПорядокОРПоИерархии</name>
  <resources>
    <name>РеквизитДопУпорядочиванияОР</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктураИерархии</name>
    <type>
      <types>CatalogRef.торо_СтруктурыОР</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cf/src/CommonModules/торо_НастройкаПорядкаЭлементовСлужебныйВызовСервера/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// торо_НастройкаПорядкаЭлементовСлужебныйВызовСервера: методы, для работы с порядком элементов.
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Функция ИзменитьПорядокЭлементов(СсылкаНаОбъект, РеквизитДопУпорядочивания, Направление, СтруктураИерархии, СтруктураСдвига, ЭлементДляОбмена = Неопределено) Экспорт
	
	Возврат торо_НастройкаПорядкаЭлементовСлужебный.ИзменитьПорядокЭлементов(
		СсылкаНаОбъект, РеквизитДопУпорядочивания, Направление, СтруктураИерархии, СтруктураСдвига, ЭлементДляОбмена);
	
КонецФункции

Процедура ПерезаполнитьПорядокЭлементовВИерархии(СтруктураИерархии) Экспорт
	
	ТаблицаИерархии = торо_РаботаСИерархией20.ПолучитьТаблицуИерархии(СтруктураИерархии);
	ТаблицаИерархии.Сортировать("РодительИерархии, ОбъектИерархии");
	
	СчётчикДопУпорядочивания = 1;
	
	НаборЗаписей = РегистрыСведений.торо_ПорядокОРПоИерархии.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.СтруктураИерархии.Установить(СтруктураИерархии);
	
	Если СтруктураИерархии.СтроитсяАвтоматически Тогда
		
		Для Каждого СтрокаТаблицы Из ТаблицаИерархии Цикл
			
			Если ЗначениеЗаполнено(СтрокаТаблицы.РодительИерархии) 
				И ТипЗнч(СтрокаТаблицы.ОбъектИерархии) = Тип("СправочникСсылка.торо_ОбъектыРемонта") Тогда
				
				НС = НаборЗаписей.Добавить();
				НС.ОбъектРемонта = СтрокаТаблицы.ОбъектИерархии;
				НС.СтруктураИерархии = СтруктураИерархии;
				НС.РеквизитДопУпорядочиванияОР = СчётчикДопУпорядочивания;
				
				СчётчикДопУпорядочивания = СчётчикДопУпорядочивания + 1;
				
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		Для Каждого СтрокаТаблицы Из ТаблицаИерархии Цикл
			НС = НаборЗаписей.Добавить();
			НС.ОбъектРемонта = СтрокаТаблицы.ОбъектИерархии;
			НС.СтруктураИерархии = СтруктураИерархии;
			НС.РеквизитДопУпорядочиванияОР = СчётчикДопУпорядочивания;
			СчётчикДопУпорядочивания = СчётчикДопУпорядочивания + 1;
		КонецЦикла;
		
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти
